#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//作用域(scope)是程序设计概念, 通常来说, 一段程序代码中所用到的名字并不总是有效(可用)的, 而限定这个名字的可用性的代码范围就是这个名字的作用域。
//1. 局部变量的作用域是变量所在的局部范围。
//2. 全局变量的作用域是整个工程(项目)。

//生命周期指的是变量的创建(申请内存)到变量的销毁(收回内存)之间的一个时间段。
//1. 局部变量的生命周期是:进入作用域变量创建, 生命周期开始, 出作用域生命周期结束。
//2. 全局变量的生命周期是 : 整个程序的生命周期。


//exterm 是用来声明外部变量
extern int b;
extern int g_val_1;
extern int g_val_2;

//声明外部函数
extern int add();

int num = 10;  //全局变量



//结论:static修饰局部变量改变了变量的生命周期, 生命周期改变的本质是改变了变量的存储类型, 本来一个局部
//变量是存储在内存的栈区的, 但是被static修饰后存储到了静态区。存储在静态区的变量和全局变量是一样的,
//生命周期就和程序的生命周期一样了, 只有程序结束, 变量才销毁, 内存才回收。但是作用域不变的。

void test()
{
	//static修饰局部变量
	static int n = 10;   //static让局部变量的生命周期延长，成为了全局变量
	n++;
	printf("%d ", n);
}

int main()
{
	{
		int a = 100;  //局部变量
		printf("a = %d\n", a);
	}
	//printf("%d", a);   “a”: 未声明的标识符
	
	printf("num = %d\n", num);
	printf("b = %d\n", b);



	int i = 0;
	for (i = 0; i < 5; i++)
	{
		test();
	}
	printf("\n");


//结论:一个全局变量被static修饰, 使得这个全局变量只能在本源文件内使用, 不能在其他源文件内使用。
//本质原因是全局变量默认是具有外部链接属性的, 在外部的文件中想使用, 只要适当的声明就可以使用;
//但是全局变量被 static 修饰之后, 外部链接属性就变成了内部链接属性,
//只能在自己所在的源文件内部使用了, 其他源文件, 即使声明了, 也是无法正常使用的。
//使用建议 : 如果一个全局变量, 只想在所在的源文件内部使用, 不想被其他文件发现, 就可以使用static修饰。

	//printf("%d\n", g_val_1);     fatal error LNK1120 : 1 个无法解析的外部命令
	
	printf("g_val_2 = %d\n", g_val_2);

	return 0;
}