#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main()
{
	////printf()的作用是将参数文本输出到屏幕。它名字里面的 f 代表 format(格式化), 表示可以定制输出文本的格式。
	//printf("hello world\n");

	//printf("%d\n", 123);

	//printf("%5d\n", 123);  //%5d表示这个占位符的宽度至少为5位，如果不满5位,对应的值的前面会添加空格。
	//printf("%5d\n", 123456);  

	////输出的值默认是右对齐, 即输出内容前面会有空格;如果希望改成左对齐, 在输出内容后面添加空格, 可以在占位符的 % 的后面插入一个 - 号。
	//printf("%-d\n", 123);  //输出的123后面，用空格补齐5位


	//printf("%f\n", 12.34);  //%f在打印小数时，默认小数点后 6 位
	//printf("%12f\n", 12.34);

	//printf("%+d\n", 10);  //打印数字时总是打印 + - 号
	//printf("%-d\n", -10);

	////限制小数位数
	//printf("%.2f\n", 123.4);
	//printf("%.2f\n", 123.455);  //结果为123.46，会有四舍五入
	//printf("%10.2f\n", 123.455);  //%10.2f 表示数字总共10位（含小数点），且小数点后保留 2 位小数
	//printf("%-10.2f\n", 123.455);  //左对齐

	//printf("%*.*f\n", 6, 2, 123.455);  //以参数的方式传递


	////输出部分字符串
	//printf("%.5s\n", "hello world");  //输出5个字符串





	int score = 0;
	printf("输入成绩：");
	scanf("%d", &score);  //& --> 取地址操作符， 获取score的地址
	printf("成绩是：%d\n", score);

	return 0;
}